//: This line will have **bold** and *italic* text.

/*:
 ## 数据结构

  #### 数组
    1.两数之和
    268. 缺失数字
    78.subsets: 回溯法
    90.子集
  #### 链表
    206.反转链表
    21.合并两个有序链表
    02.两数相加
    24.两两交换表中的节点
  #### 队列

  #### 栈

  #### 堆

  #### 二叉树：根节点，叶子节点，
  
  
 ## 常用算法

 #### 回溯算法：
  递归伪代码：
  

 * N个节点，输出所有的二进制数，每个节点可以为0和1.

  answer：https://www.bilibili.com/video/BV1S54y1B7MU?from=search&seid=5552030452773635953
  * 输出全排列1,2,3的数组全排列
  #### 双指针，
 
 #### 二分法，
 
 #### 滑动窗口，
 
 #### 递归，
 
 ####分治，
 
 ####BFS，
 
 ####DFS，
 
 ####union find
 
 ####动态规划。
 
 
 时间复杂度
 
 空间复杂度
 
  ## leetcode题目
  
    ####
  
  
  
  
  
  


 
 */
